{
 "comment": "'Mmm' represents a three-letter month abbreviation, and can be one of the following: Jan, Feb, Mar, Apr, May, Jun, Jul, Aug, Sep, Oct, Nov, Dec 'YYYY' is a four-digit value representing the year. 'MM' is a two-digit value representing the month. 'DD' is a two-digit value representing the day of the month. 'hh' is a two-digit value representing the hour of the day (00 to 23) 'mm' is a two-digit value representing the minute of the hour (00 to 59) 'ss' is a two-digit value representing the second of the hour (00 to 59) Within a date range, value formats that make use of 'Mmm' (month abbreviations) cannot be combined with value formats that make use of 'MM' (two-digit month number) Collection dates that are specified to at least the month, day, and year (DD-Mmm-YYYY or YYYY-MM-DD) are strongly encouraged. If the day and/or month of the collection date are not known, Mmm-YYYY or YYYY-MM or YYYY may be used. Within a collection date range, the first date (possibly including time) must be prior to the second date (possibly including time). Within a collection date range for which the day, month, and year are identical, the first time value must be prior to the second time value.", 
 "definition": "The date on which the specimen was collected. Date/time ranges are supported by providing two collection dates from among the supported value formats, delimited by a forward-slash character. Collection times are supported by adding \"T\", then the hour and minute and seconds, after the date. Collection times must be in Coordinated Universal Time (UTC), otherwise known as \"Zulu Time\" (Z).", 
 "example": "/collection_date=\"21-Oct-1952\" /collection_date=\"Oct-1952\" /collection_date=\"1952\" /collection_date=\"1952-10-21T11:43Z\" /collection_date=\"1952-10-21T11Z\" /collection_date=\"1952-10-21\" /collection_date=\"1952-10\" /collection_date=\"21-Oct-1952/15-Feb-1953\" /collection_date=\"Oct-1952/Feb-1953\" /collection_date=\"1952/1953\" /collection_date=\"1952-10-21/1953-02-15\" /collection_date=\"1952-10/1953-02\" /collection_date=\"1952-10-21T11:43Z/1952-10-21T17:43Z\" /collection_date=\"2015-10-11T17:53:03Z\"", 
 "qualifier": "collection_date", 
 "value_format": "\"DD-Mmm-YYYY\", \"Mmm-YYYY\", \"YYYY\" \"YYYY-MM-DDThh:mmZ\", \"YYYY-MM-DDThh:mm:ssZ\", \"YYYY-MM-DDThhZ\", \"YYYY-MM-DD\", or \"YYYY-MM\""
}
